{"module": "keras.src.models.functional", "class_name": "Functional", "config": {"name": "vit_unet_lite", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_shape": [null, 128, 128, 4], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer"}, "registered_name": null, "name": "input_layer", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 64, "kernel_size": [8, 8], "strides": [8, 8], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "registered_name": null, "build_config": {"input_shape": [null, 128, 128, 4]}, "name": "conv2d", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 128, 128, 4], "dtype": "float32", "keras_history": ["input_layer", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.layers", "class_name": "Reshape", "config": {"name": "reshape", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "target_shape": [256, 64]}, "registered_name": null, "build_config": {"input_shape": [null, 16, 16, 64]}, "name": "reshape", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 16, 16, 64], "dtype": "float32", "keras_history": ["conv2d", 0, 0]}}], "kwargs": {}}]}, {"module": "keras.src.ops.numpy", "class_name": "Add", "config": {"name": "add"}, "registered_name": "Add", "name": "add", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 256, 64], "dtype": "float32", "keras_history": ["reshape", 0, 0]}}, {"class_name": "__tensor__", "config": {"value": [[-0.021980345249176025, -0.04803336784243584, 0.010665904730558395, -0.013434458523988724, 0.02206050232052803, 0.04883427545428276, 0.0478745736181736, 0.0054441094398498535, -0.023375416174530983, -0.016246188431978226, 0.014886807650327682, 0.022432398051023483, -0.026112748309969902, 0.042997006326913834, -0.002438794821500778, -0.04546767473220825, 0.02617492899298668, -0.041607461869716644, -0.041490934789180756, -0.02914811484515667, 0.04313040152192116, -0.02894136868417263, 0.034601178020238876, -0.034954093396663666, 0.02039286121726036, 0.00849456712603569, 0.0009046308696269989, -0.019510461017489433, -0.004441428929567337, 0.031460393220186234, 0.023562941700220108, -0.03265100717544556, 0.033505890518426895, -0.003453552722930908, -0.04817771911621094, -0.011938273906707764, -0.008374370634555817, -0.015500079840421677, 0.04973587021231651, -0.0469822883605957, 0.0344722606241703, -0.04720431566238403, 0.018337253481149673, -0.044400084763765335, -0.0400700569152832, 0.018376421183347702, 0.03176764026284218, 0.046214427798986435, -0.029510319232940674, 0.033705901354551315, -0.04134867340326309, -0.008224941790103912, 0.0030979886651039124, -0.04326821491122246, -0.011698268353939056, 0.04646540805697441, 0.00970611721277237, 0.024741601198911667, 0.0009811893105506897, 0.006196819245815277, 0.02260563150048256, -0.03144686296582222, -0.013099394738674164, -0.00416940450668335], [0.00916079431772232, 0.04981278255581856, -0.013010777533054352, -0.034059930592775345, -0.00831381231546402, 0.0247621051967144, 0.041673693805933, 0.045400332659482956, -0.03461937978863716, -0.03625812381505966, 0.04518828168511391, 0.04240133985877037, 0.023819807916879654, -0.0326179638504982, 0.0026584751904010773, 0.023540031164884567, 0.02107665315270424, 0.032325539737939835, -0.017103374004364014, 0.012992683798074722, 0.01014731079339981, -0.0082925446331501, 0.005688905715942383, 0.027672577649354935, 0.0034242160618305206, 0.03702045604586601, -0.0006780736148357391, 0.035502102226018906, -0.03657921403646469, 0.03738642856478691, 0.03169815614819527, 0.005141198635101318, -0.04852401092648506, -0.02982851304113865, 0.0168573297560215, -0.01897491328418255, -0.0015080347657203674, 0.037729885429143906, -0.027728307992219925, 0.0199727900326252, 0.009487796574831009, -0.03079439513385296, 0.03503533825278282, 0.036332082003355026, 0.03370126709342003, 0.047282468527555466, 0.013328064233064651, 0.007141031324863434, -0.020553171634674072, 0.02594572678208351, -0.00981978327035904, -0.021262455731630325, 0.022432278841733932, -0.007354676723480225, 0.02844918891787529, -0.025037670508027077, 0.005580782890319824, 0.029381874948740005, -0.026517881080508232, 0.028500724583864212, -0.04985826089978218, -0.03658264875411987, 0.021893765777349472, 0.038728367537260056], [-0.001507449895143509, -0.0025444738566875458, 0.044193778187036514, 0.007837604731321335, -0.008497975766658783, -0.03487731143832207, -0.020921099931001663, 0.04964471235871315, -0.042702533304691315, 0.03642037883400917, -0.04928579553961754, -0.02067406289279461, 0.029097173362970352, 0.004557859152555466, 0.015765760093927383, 0.007451415061950684, -0.02026590146124363, 0.024459388107061386, -0.04007841274142265, -0.03645577281713486, -0.02352248504757881, -0.011194836348295212, -0.023103011772036552, -0.001601971685886383, 0.04455072060227394, 0.020047571510076523, -0.003203071653842926, -0.00636894628405571, -0.013470757752656937, -0.045231569558382034, 0.009284235537052155, -0.04101921245455742, -0.025166058912873268, 0.004561461508274078, 0.047971490770578384, -0.016070879995822906, -0.022402573376893997, -0.0021141543984413147, 0.047467950731515884, 0.040584746748209, 0.011728882789611816, -0.01579984277486801, 0.02852710708975792, -0.0036087259650230408, 0.030763957649469376, -0.029442930594086647, -0.015311408787965775, -0.04317012056708336, -0.0348287932574749, 0.0060533396899700165, 0.027958277612924576, 0.026480544358491898, 0.0005834214389324188, -0.027722705155611038, 0.012373663485050201, 0.04776041582226753, 0.039077553898096085, -0.023276103660464287, 0.03093954548239708, 0.04547050967812538, -0.039834391325712204, -0.04150458425283432, -0.03693953901529312, -0.0003432147204875946], [0.003966927528381348, 0.006803952157497406, -0.001260172575712204, -0.006158996373414993, -0.038268160074949265, 0.022976014763116837, -0.0061248429119586945, 0.023917485028505325, -0.006480097770690918, 0.046901870518922806, -0.01447070762515068, 0.03282947465777397, 0.03787651285529137, 6.812810897827148e-05, 0.03966623917222023, -0.033374033868312836, 0.03490908071398735, -0.001277528703212738, -0.0312174204736948, -0.03755086660385132, 0.04346175119280815, 0.04660384729504585, -0.03600888326764107, -0.004724062979221344, -0.011810027062892914, 0.0341314934194088, 0.03941095992922783, 0.04456743970513344, -0.001349080353975296, 0.043314460664987564, 0.04186462238430977, -0.03789695352315903, -0.03595688194036484, -0.007664967328310013, 0.00886615365743637, 0.021347511559724808, 0.02972308173775673, -0.028217781335115433, -0.009890057146549225, 0.014995221048593521, -0.007741570472717285, -0.04552752897143364, 0.04957599565386772, -0.001912139356136322, -0.02125268056988716, -0.027465403079986572, -0.025076521560549736, -0.016353368759155273, 0.038296882063150406, 0.01742643490433693, 0.013418260961771011, 0.020678769797086716, 0.028662312775850296, -0.03875124454498291, 0.0347803495824337, -0.03916919231414795, -0.015489794313907623, -0.036691807210445404, 0.010125327855348587, -0.01142110675573349, -0.02185542695224285, 0.02711794152855873, -0.020819222554564476, 0.03958306089043617], [0.04961205646395683, 0.005280517041683197, 0.012018941342830658, -0.04714393615722656, 0.018638495355844498, 0.0156804658472538, -0.017131827771663666, -0.04317686706781387, 0.012377679347991943, -0.011423040181398392, -0.02024369314312935, 0.046904969960451126, -0.04461510106921196, 0.005573488771915436, -0.005819357931613922, -0.0136917345225811, -0.029871368780732155, -0.04781704023480415, 0.037570249289274216, 0.03624690696597099, 0.017343129962682724, -0.0023774132132530212, 0.008400239050388336, 0.03693074360489845, -0.019861817359924316, 0.046369779855012894, -0.033460140228271484, 0.0016056187450885773, 0.03795086219906807, -0.031377315521240234, -0.0035255923867225647, -0.04642132669687271, -0.04663578420877457, -0.03624916076660156, 0.021624159067869186, 0.02932509407401085, 0.03514799848198891, -0.014493465423583984, 0.038469281047582626, -0.041470348834991455, 0.00849846750497818, 0.024256933480501175, 0.04042224958539009, -0.023213421925902367, -0.00786890834569931, -0.01306220144033432, 0.033012356609106064, -0.046074774116277695, -0.03682389110326767, 0.025255713611841202, -0.034303463995456696, -0.03619598224759102, -0.022055840119719505, -0.01021864265203476, 0.004769038408994675, -0.044186320155858994, 0.028979409486055374, -0.029514921829104424, -0.014336623251438141, 0.04199809208512306, 0.03434676304459572, -0.03741234540939331, 0.027978967875242233, -0.018034815788269043], [-0.04787125810980797, -0.009623587131500244, 0.024777207523584366, -0.040386296808719635, 0.02854413166642189, -0.0013838186860084534, 0.04527087137103081, -0.04015076160430908, 0.04331681504845619, 0.016516517847776413, -0.01566099002957344, 0.02413405105471611, -0.011706925928592682, 0.00873558595776558, -0.00486982986330986, -0.04530158266425133, -0.04343143850564957, -0.021388841792941093, -0.009828247129917145, -0.0023052915930747986, 0.0463843010365963, 0.03919258341193199, -0.020981550216674805, -0.04160541296005249, 0.021805886179208755, -0.04813368245959282, -0.04135415703058243, -0.04622634872794151, -0.003120921552181244, 0.040802087634801865, -0.0399516336619854, 0.02175455167889595, 0.0030235648155212402, 0.02085414156317711, -0.04482216760516167, 0.01278756931424141, -0.041374851018190384, 0.02217980846762657, 0.03132685646414757, 0.008874941617250443, 0.03908027336001396, -0.04927978664636612, 0.015998195856809616, -0.025288820266723633, -0.020083332434296608, -0.03839311748743057, 0.01373305544257164, -0.003037393093109131, -0.04806503280997276, -0.021976018324494362, -0.002413712441921234, 0.0029189474880695343, 0.0066062211990356445, -0.02526804246008396, -0.03880380466580391, -0.004669081419706345, -0.03484691306948662, 0.015649545937776566, -0.02258068323135376, -0.019981635734438896, 0.019582081586122513, -0.03636350482702255, 0.03880647197365761, -0.035636723041534424], [0.019098427146673203, -0.024688756093382835, 0.045959893614053726, 0.013309862464666367, -0.03257288783788681, -0.04531595855951309, 0.020722951740026474, -0.007914185523986816, 0.044629279524087906, 0.009572245180606842, -0.016068506985902786, -0.03665883466601372, -0.016678370535373688, 0.024821687489748, 0.006394028663635254, -0.017625607550144196, -0.04668219015002251, 0.0439973808825016, -0.04915891960263252, -0.026634549722075462, 0.004538096487522125, 0.025108184665441513, -0.01698458194732666, -0.003605462610721588, -0.0074034444987773895, 0.0345248244702816, -0.04636157676577568, -0.02995091676712036, 0.004905056208372116, -0.04634873941540718, -0.002201925963163376, 0.037758175283670425, -0.028308678418397903, -0.004071284085512161, -0.006137251853942871, -0.024898577481508255, -0.00607144832611084, -0.04728526994585991, -0.02734403684735298, 0.028066229075193405, 0.03419956937432289, -0.03622729703783989, -6.020069122314453e-05, -0.018837904557585716, -0.023215699940919876, 0.010073564946651459, 0.03579417243599892, 0.035387877374887466, -0.0024854056537151337, 0.027511324733495712, 0.005576241761445999, 0.033720385283231735, 0.0034365765750408173, -0.042605210095644, -0.017902325838804245, -0.009982656687498093, -0.0009092316031455994, 0.0455058328807354, 0.02555856481194496, 0.019948724657297134, 0.020861197263002396, -0.013134550303220749, 0.03503004088997841, -0.024471426382660866], [0.0387556292116642, 0.04224855825304985, -0.024453772231936455, 0.04116251692175865, 0.024122226983308792, -0.03918495029211044, -0.009642601013183594, -0.03825143724679947, -0.005115341395139694, -0.048501502722501755, 0.0025443807244300842, -0.0376463420689106, 0.01613664999604225, -0.017022468149662018, -0.044306255877017975, -0.03205620124936104, 0.027919303625822067, 0.013727936893701553, -0.04902932792901993, 0.0141761414706707, -0.04015611484646797, 0.03298382833600044, 0.029006723314523697, -0.0010969266295433044, 0.02679559960961342, -0.04520920664072037, 0.009281646460294724, -0.008756328374147415, -0.01706589385867119, 0.00526418536901474, 0.04586869850754738, -0.01844487339258194, -0.012261427938938141, 0.03927663341164589, -0.0033741481602191925, -0.007830105721950531, -0.04994016885757446, 0.0027876608073711395, 0.04171362891793251, 0.005788695067167282, 0.014287654310464859, 0.04382021352648735, -0.007657993584871292, 0.04483436420559883, -0.013347040861845016, -0.014039766043424606, 0.04163074865937233, -0.023244107142090797, -0.04406202957034111, 0.045162882655858994, 0.046513427048921585, 0.04104771837592125, -0.04284733533859253, 0.030696365982294083, -0.0027529485523700714, 0.026996079832315445, -0.0110793337225914, -0.03382086753845215, -0.03558061271905899, -0.013547707349061966, -0.04706496000289917, -0.012012898921966553, 0.045511338859796524, -0.019763994961977005], [0.004383157938718796, 0.04927560314536095, -0.046305812895298004, 0.013923201709985733, 0.017573285847902298, -0.041133154183626175, 0.039604511111974716, -0.044687092304229736, 0.00040088966488838196, 0.0020227916538715363, -0.01739814132452011, -0.027306532487273216, 0.014443065971136093, -0.000399123877286911, -0.03649401664733887, 0.03339178487658501, 0.02507868781685829, -0.039926886558532715, -0.0460844524204731, 0.031102541834115982, 0.011081993579864502, 0.01430562511086464, 0.0014197342097759247, 0.022299114614725113, 0.023190271109342575, 0.017107952386140823, -0.049245383590459824, 0.040164101868867874, 0.0486113540828228, 0.048947904258966446, -0.04974113777279854, -0.021329140290617943, 0.03877456113696098, 0.019406411796808243, -0.03078765980899334, -0.003348875790834427, 0.004939746111631393, -0.004523634910583496, -0.021555138751864433, -0.03474019840359688, -0.04621514305472374, -0.018636606633663177, -0.007360983639955521, 0.023512031883001328, 0.01860770955681801, -0.0036193616688251495, -0.02372373454272747, 0.04110309109091759, -0.023538803681731224, -0.04423630237579346, 0.01975642517209053, -0.003275621682405472, -0.01952505111694336, 0.02853107824921608, -0.021385585889220238, -0.012020982801914215, -0.00476527214050293, -0.007893107831478119, -0.0014655590057373047, 0.031582798808813095, -0.010378468781709671, 0.01467764750123024, 0.03920352831482887, -0.02082580327987671], [-0.04319576174020767, 0.03488573804497719, 0.02873988077044487, 0.012544360011816025, 0.0031761638820171356, -0.024230528622865677, -0.0467832088470459, -0.026506269350647926, -0.01472703367471695, -0.033581413328647614, -0.04207799583673477, -0.015205524861812592, 0.026767287403345108, -0.0024490132927894592, -0.004324533045291901, 0.025303270667791367, 0.03074495866894722, -0.0421297661960125, 0.03174244239926338, -0.049877893179655075, -0.020314956083893776, -0.023627210408449173, -0.02690654993057251, -0.00710684061050415, 0.01822211965918541, -0.024584734812378883, 0.020331311970949173, 0.0002092011272907257, 0.01213926076889038, -0.026504505425691605, -0.026600945740938187, 0.03868425264954567, 0.03839293494820595, -0.04114411026239395, 0.00931570678949356, -0.018043696880340576, -0.04312453418970108, -0.011681772768497467, -0.027977097779512405, 0.021384980529546738, 0.02037901058793068, -0.03854259103536606, -0.01258298009634018, -0.04228859022259712, 0.006782747805118561, -0.044044267386198044, 0.040898289531469345, -0.04533860832452774, 0.0261673666536808, -0.03898818418383598, 0.0230255164206028, 0.007413256913423538, -0.0339953787624836, 0.0020260699093341827, -0.008118808269500732, 0.012087620794773102, -0.029693592339754105, -0.03310810402035713, -0.005362294614315033, 0.018465686589479446, -0.03862731531262398, 0.034990739077329636, 0.003208387643098831, 0.018997061997652054], [-0.012519381940364838, -0.003252338618040085, -0.044855810701847076, -0.042511891573667526, -0.04505202919244766, -0.01910022459924221, 0.03364967182278633, 0.00020084530115127563, -0.04424485191702843, -0.012898124754428864, 0.0211469866335392, 0.03425129875540733, 0.011002086102962494, 0.03564554825425148, -0.00878368690609932, 0.014930788427591324, 0.007335055619478226, -0.045942723751068115, -0.04656825214624405, 0.011620402336120605, -0.049445249140262604, -0.023010481148958206, 0.005362130701541901, 0.012063335627317429, 0.020239900797605515, -0.04831717163324356, -0.003073502331972122, -0.0157003290951252, -0.029326308518648148, -0.012126971036195755, 0.0009737387299537659, 0.03869536891579628, -0.014960922300815582, 0.010527528822422028, -0.01994112692773342, -0.0037054307758808136, 0.00753030925989151, -0.02408452145755291, -0.03125741332769394, -0.04358837753534317, -0.030968988314270973, 0.0351550467312336, 0.028516147285699844, -0.04019339010119438, 0.026988152414560318, 0.028545621782541275, -0.024568451568484306, 0.00897122547030449, -0.007159687578678131, 0.008129715919494629, 0.032919351011514664, -0.015761565417051315, 0.029274489730596542, -0.049389421939849854, -0.04299382120370865, 0.023463252931833267, 0.03994331136345863, 0.04833662882447243, -0.01633673906326294, 0.044780049473047256, -0.011239886283874512, 0.006193242967128754, -0.02628016471862793, 0.03183884546160698], [0.03685775771737099, 0.02592991665005684, 0.047195617109537125, 0.013637606054544449, 0.04112185165286064, -0.03323769569396973, -0.010098814964294434, 0.03867752477526665, 0.029693666845560074, -0.01448965072631836, 0.029717113822698593, -0.011504221707582474, -0.04229297861456871, 0.031637344509363174, -0.010330893099308014, -0.004536151885986328, 0.002825796604156494, 0.012724805623292923, 0.024882379919290543, -0.03246504068374634, 0.030104029923677444, -0.0027922987937927246, -0.012632656842470169, 0.0008873455226421356, 0.005247723311185837, 0.02016070857644081, 0.0290384404361248, 0.0059629566967487335, -0.019378531724214554, -0.02676924504339695, 0.03403879329562187, 0.030782435089349747, -0.04487215355038643, 0.023568999022245407, -0.006021212786436081, 0.013266149908304214, -0.014328204095363617, 0.046798478811979294, -0.0418223962187767, -0.02005777321755886, 0.010713111609220505, -0.04929257556796074, -0.04939072206616402, -0.006702877581119537, -0.015787281095981598, 0.02160618081688881, -0.007253073155879974, -0.047901224344968796, 0.04156806692481041, -0.00887216255068779, -0.007501233369112015, 0.036307062953710556, 0.014145825058221817, 0.011613667011260986, 0.0030737146735191345, -0.017714060842990875, -0.033102847635746, -0.024358272552490234, -0.032418228685855865, -0.04576058313250542, 0.0032818689942359924, 0.03857104852795601, 0.03640475496649742, -0.013153959065675735], [-0.008391320705413818, -0.013507712632417679, 0.0347491018474102, 0.03877140209078789, 0.026121724396944046, -0.012132920324802399, 0.0384259931743145, -0.03145483881235123, -0.020669246092438698, 0.0076808929443359375, -0.007072247564792633, 0.021811071783304214, -0.03319326788187027, 0.013708043843507767, -0.014119338244199753, 0.04824662581086159, 0.009150553494691849, 0.005197487771511078, 0.026686694473028183, -0.018076252192258835, -0.034139297902584076, -0.023443294689059258, -0.007839202880859375, 0.02133960649371147, -0.04111555963754654, -0.034988582134246826, -0.04075797647237778, -0.021840417757630348, 0.030929218977689743, 0.004627980291843414, 0.006693661212921143, -0.02479705773293972, -0.01712115854024887, -0.03182172775268555, 0.0412304662168026, -0.029013825580477715, -0.0015178434550762177, 0.018613312393426895, -0.034565769135951996, -0.018790865316987038, -0.014942944049835205, -0.02638249471783638, -0.0493241548538208, 0.037049125880002975, 0.010533429682254791, 0.033874060958623886, -0.001942180097103119, 0.0019021742045879364, -0.0194665789604187, 0.011854827404022217, -0.014019511640071869, -0.0007406696677207947, 0.04603779688477516, -0.02744731865823269, -0.015782762318849564, 0.009312283247709274, 0.04386129602789879, -0.04634213447570801, 0.029812227934598923, 0.02075101062655449, 0.0038766972720623016, -0.004447650164365768, 0.0027174465358257294, 0.025590743869543076], [-0.045848168432712555, 0.03637147322297096, -0.00920846313238144, 0.0023074261844158173, -0.0022626295685768127, 0.012267448008060455, 0.00445624440908432, 0.009634695947170258, -0.027639472857117653, 0.04262319579720497, -0.006939280778169632, 0.02941380813717842, -0.025489045307040215, 0.03970341756939888, -0.027401531115174294, 0.02538684383034706, -0.018235765397548676, -0.0291631817817688, -0.023079872131347656, 0.009613990783691406, -0.01864827796816826, 0.012719061225652695, -0.04628286510705948, 0.00025205686688423157, 0.022449318319559097, -0.03374361991882324, -0.04996442794799805, -0.04085559770464897, 0.04967642202973366, -0.04490171745419502, 0.038447264581918716, 0.0008340254426002502, 0.0029907822608947754, -0.04681823402643204, -0.018559981137514114, 0.011156819760799408, 0.017006758600473404, -0.036285649985075, 0.02570439502596855, -0.007135249674320221, -0.037325989454984665, -0.01967625692486763, 0.038654033094644547, -0.01844879239797592, -0.0004258863627910614, 0.01838238164782524, -0.002596259117126465, -0.025065649300813675, -0.013182103633880615, -0.04158862680196762, -0.04842541366815567, -0.022919345647096634, 0.029855262488126755, 0.02747965231537819, -0.02906268835067749, 0.01648564264178276, -0.011570166796445847, 0.011903606355190277, -0.005253266543149948, 0.03957324102520943, 0.031032588332891464, -0.008806824684143066, -0.02499610185623169, 0.017400946468114853], [0.038819778710603714, -0.04460519552230835, -0.020100880414247513, 0.04684341326355934, 0.011975754052400589, -0.001559533178806305, 0.0024043433368206024, -0.014455843716859818, 0.001698862761259079, 0.031071867793798447, 0.027796518057584763, -0.022113895043730736, 0.02692914381623268, -0.01767563819885254, 0.01404634490609169, 0.04756293073296547, 0.02850445732474327, -0.013661324977874756, 0.02719283476471901, 0.025432530790567398, 0.048459675163030624, 0.04267523065209389, -0.014104880392551422, -0.006315339356660843, -0.013218365609645844, -0.009003937244415283, -0.00782383605837822, -0.016244232654571533, 0.0137261264026165, -0.005356155335903168, 0.011545110493898392, 0.013014677911996841, -0.015827439725399017, 0.04458143934607506, 0.01628502830862999, -0.016437064856290817, -0.012039769440889359, 0.01611078903079033, 0.03335541859269142, 0.01157832145690918, 0.04623595252633095, -0.04506125673651695, -0.025966370478272438, 0.0024595968425273895, 0.03509130701422691, -0.041747450828552246, 0.005591988563537598, 0.029280949383974075, 0.0422627218067646, -0.010465525090694427, 0.04656180366873741, 0.009371329098939896, -0.016229700297117233, -0.045384086668491364, -0.03975426033139229, -0.018391858786344528, 0.03299403563141823, -0.026581287384033203, -0.0077366456389427185, 0.03212456777691841, 0.047564271837472916, -0.02706667222082615, -0.00035855919122695923, -0.012073896825313568], [-0.026690125465393066, -0.02823868952691555, 0.028241541236639023, 0.01576078310608864, 0.027491819113492966, -0.03385742008686066, 0.000993918627500534, 0.0205024816095829, -0.007663000375032425, -0.008909501135349274, -0.003111600875854492, 0.013337556272745132, 0.042990658432245255, 0.048548709601163864, 0.014217022806406021, -0.02084268443286419, 0.016818594187498093, -0.00717327743768692, -0.010730136185884476, -0.04335857555270195, -0.01328565925359726, -0.036483872681856155, -0.030984437093138695, -0.016184698790311813, 0.041114721447229385, 0.03795447573065758, -0.012922216206789017, 0.037817928940057755, 0.0018887147307395935, 0.0315004326403141, 0.00192255899310112, -0.016061674803495407, 0.03764648362994194, 0.002821527421474457, -0.03780486434698105, -0.0012046098709106445, 0.0072419047355651855, 0.01216580718755722, 0.00393306091427803, -0.02902773581445217, 0.004299759864807129, -0.03776957839727402, 0.004030454903841019, -0.022453952580690384, 0.029963936656713486, 0.0015964619815349579, -0.0046619996428489685, 0.009597539901733398, 0.027774523943662643, 0.04515831544995308, -0.01255117729306221, 0.03352612629532814, -0.013424515724182129, 0.03338606283068657, 0.04377471283078194, 0.02551085129380226, 0.042057279497385025, 0.0020936131477355957, 0.0117255337536335, -0.044056691229343414, 0.02646983042359352, 0.029684316366910934, -0.016175102442502975, -0.04148911312222481], [-0.03473097085952759, -0.040948521345853806, -0.04177042096853256, -0.04966069385409355, 0.012574505060911179, -0.03998366743326187, -0.007307123392820358, 0.0010704994201660156, 0.015543948858976364, -0.03313400596380234, 0.013712141662836075, -0.04256027936935425, -0.04322949796915054, 0.026894178241491318, -0.04320794343948364, 0.0001949891448020935, 0.011686861515045166, 0.002757895737886429, 0.03469950333237648, 0.015146564692258835, 0.02110426500439644, 0.020255494862794876, 0.0038534291088581085, -0.017484258860349655, -0.03989241272211075, 6.843730807304382e-05, 0.033356454223394394, -0.03065289370715618, -0.02142317406833172, -0.012379609048366547, -0.04852570220828056, -0.006845735013484955, -0.01203630119562149, -0.024241840466856956, 0.009657502174377441, -0.0012529268860816956, -0.0220391396433115, -0.016111113131046295, -0.04435589537024498, -0.010095261037349701, 0.02518249675631523, 0.04116291180253029, 0.014903757721185684, 0.0430162288248539, -0.002059139311313629, 0.026920828968286514, -0.04940711334347725, -0.004031755030155182, -0.029590165242552757, 0.006726276129484177, 0.02958938106894493, -0.0001544468104839325, 0.0408138744533062, -0.0031645409762859344, -0.0067309364676475525, -0.02770071104168892, -0.03880218416452408, 0.030812334269285202, -0.04590175300836563, 0.024144019931554794, -0.040929507464170456, 0.027001086622476578, -0.03389422968029976, -0.03850071504712105], [-0.04615180566906929, -0.0454324372112751, 0.02523273602128029, -0.029118120670318604, 0.017088424414396286, 0.026583079248666763, 0.013215173035860062, -0.008224330842494965, 0.002582550048828125, -0.04983328655362129, -0.004761196672916412, -0.0007024630904197693, 0.03075246885418892, -0.04652797058224678, 0.027662400156259537, 0.01110086590051651, 0.009416211396455765, -0.024103140458464622, -0.009401179850101471, -0.02743600681424141, -0.027814781293272972, 0.04709747061133385, -0.010591946542263031, 0.010925211012363434, -0.03176586702466011, -0.044858552515506744, -0.013424299657344818, 0.03875875845551491, -0.0017786026000976562, 0.0056475624442100525, 0.01660672202706337, 0.026678983122110367, -0.026274753734469414, -0.01646782085299492, 0.02254212275147438, 0.016189362853765488, 0.001056324690580368, 0.013255801051855087, -0.039881668984889984, 0.02476031705737114, -0.049367308616638184, 0.017803076654672623, 0.012935016304254532, -0.040438078343868256, -0.040608275681734085, -0.039540816098451614, -0.040842413902282715, -0.04048573970794678, -0.02890169620513916, -0.017863642424345016, -0.039958227425813675, 0.03733184561133385, 0.013244573026895523, -0.04238162189722061, 0.04015973582863808, 0.013198088854551315, 0.014764714986085892, 0.0163046233355999, -0.017462730407714844, 0.0314527191221714, 0.015636656433343887, 0.035677600651979446, 0.04694734886288643, 0.04863831773400307], [0.0334288589656353, 0.004337679594755173, -0.009318508207798004, 0.04356434568762779, -0.03409760072827339, 0.03068092092871666, 0.011864017695188522, -0.011700998991727829, -0.03138456493616104, 0.04595664516091347, 0.005274176597595215, -0.0206467155367136, 0.04417479410767555, 0.021258506923913956, 0.010509025305509567, 0.034204673022031784, 0.029115621000528336, 0.013288024812936783, -0.00917135551571846, 0.0009020790457725525, 0.007688414305448532, 0.01458071544766426, -0.03373466804623604, 0.0013360492885112762, -0.02677379921078682, 0.03311488404870033, -0.0022963285446166992, -0.006532512605190277, 0.02145550027489662, 0.010366331785917282, -0.002435147762298584, 0.01105273887515068, 0.008554898202419281, 0.017984557896852493, 0.005209922790527344, -0.040207553654909134, 0.0410277359187603, 0.039647530764341354, -0.006154023110866547, 0.03401592746376991, -0.009192429482936859, -0.015080701559782028, 0.031646061688661575, -0.035767506808042526, -0.008188046514987946, 0.001527201384305954, 0.019395653158426285, -0.03393413871526718, -0.027917778119444847, 0.020838726311922073, 0.02257997915148735, -0.03917081281542778, -0.04531285911798477, 0.00966719537973404, -0.003650795668363571, -0.029305053874850273, 0.04043518379330635, 0.010530196130275726, -0.024129344150424004, -0.024150824174284935, -0.022066820412874222, 0.04014625772833824, 0.01027829572558403, 0.02960057184100151], [0.022694934159517288, 0.03239425644278526, -0.025197505950927734, -0.017378926277160645, 0.04166224226355553, 0.039376821368932724, 0.02139444276690483, 0.013050783425569534, -0.004600606858730316, -0.0002575889229774475, -0.016044925898313522, 0.010172557085752487, 0.02873358502984047, 0.0356794111430645, 0.009407710283994675, -0.009195398539304733, -0.00835353136062622, -0.006481550633907318, 0.036151353269815445, 0.04238324239850044, -0.04399222135543823, 0.044205550104379654, 0.0009388551115989685, 0.018574509769678116, 0.014299634844064713, 0.014121141284704208, -0.022462714463472366, -0.0345667228102684, 0.0025107748806476593, -0.014791510999202728, -0.02802828513085842, 0.02302045002579689, -0.038627494126558304, 0.04734641686081886, 0.02756008878350258, 0.010007690638303757, 0.02588912472128868, 0.044641684740781784, -0.00196152925491333, 0.007607351988554001, -0.013014066964387894, -0.04859234020113945, -0.00227510929107666, -0.048200976103544235, 0.045011747628450394, 0.022004690021276474, -0.00897911936044693, -0.022860540077090263, 0.0255950428545475, 0.04851876571774483, 0.048597048968076706, -0.0014849305152893066, -0.01512284204363823, 0.0370074026286602, 0.04722105339169502, 0.043364059180021286, 0.02788369730114937, 0.01991729810833931, 0.03888494148850441, 0.03497947379946709, -0.002519465982913971, -0.04383573681116104, 0.01215900108218193, 0.002488981932401657], [-0.02182859182357788, -0.038367461413145065, -0.01346299797296524, 0.025980602949857712, 0.04223615303635597, -0.01581360027194023, -0.045796286314725876, -0.03291346877813339, 0.0013955123722553253, -0.03682374954223633, 0.04838446155190468, 0.011593092232942581, 0.020370755344629288, 0.010383021086454391, -0.04397239908576012, 0.03416105732321739, 0.01575949415564537, -0.004793893545866013, -0.04570115730166435, 0.022074487060308456, 0.031586457043886185, 0.02864145115017891, 0.040114354342222214, 0.034235481172800064, -0.046723008155822754, -0.04888429865241051, 0.0026625171303749084, -0.025518381968140602, 0.02372680976986885, 0.017577674239873886, -0.00749659538269043, 0.01058562844991684, 0.005574703216552734, 0.0007601752877235413, 0.0054107531905174255, 0.025545183569192886, -0.04517247900366783, -0.018647849559783936, -0.017847955226898193, 0.03697240725159645, -0.04613909870386124, -0.005886483937501907, 0.04295678064227104, -0.01327812671661377, 0.018575381487607956, -0.014933180063962936, -0.015383731573820114, 0.007025051862001419, -0.012199092656373978, -0.006175480782985687, 0.007649563252925873, 0.020092163234949112, 0.016878116875886917, -0.03312011808156967, 0.04371383413672447, 0.04685273393988609, 0.01349276676774025, 0.020817790180444717, 0.0387868769466877, 0.027743350714445114, -0.018899917602539062, 0.01584334298968315, 0.025100503116846085, 0.01949150487780571], [-0.016532838344573975, -0.02725064754486084, -0.02782961167395115, 0.032912660390138626, -0.003200054168701172, 0.030967090278863907, 0.020618129521608353, 0.033427704125642776, -0.02513211965560913, 0.016893420368433, -0.029571617022156715, 0.011607669293880463, -0.04346450790762901, 0.00645827129483223, 0.01882364973425865, 0.031754765659570694, 0.013336632400751114, 0.04133037105202675, -0.027108360081911087, 0.036160413175821304, 0.039263758808374405, 0.013574253767728806, 0.006611645221710205, 0.0003916248679161072, -0.007423508912324905, 0.008755147457122803, -0.041893016546964645, 0.02173788473010063, 0.02196819707751274, -0.02628694847226143, -0.004647709429264069, 0.04303402826189995, -0.009988535195589066, -0.00625290721654892, -0.021406127139925957, -0.012772094458341599, 0.008266378194093704, 0.013036016374826431, -0.04267728328704834, -0.03173553943634033, -0.04077506065368652, 0.007782291620969772, -0.03881805017590523, 0.026546429842710495, 0.03767987713217735, 0.02727675810456276, 0.044066522270441055, 0.00571209192276001, 0.0011025294661521912, 0.03671307489275932, -0.023705054074525833, -0.009068943560123444, 0.016567420214414597, 0.02475564554333687, 0.02318831905722618, 0.023948941379785538, 0.04229531064629555, 0.006832398474216461, -0.011271573603153229, 0.019442427903413773, -0.044183697551488876, 0.03192530944943428, 0.03041646257042885, 0.0011282674968242645], [0.04463643953204155, -0.035751186311244965, 0.032291363924741745, 0.04091070964932442, -0.014180291444063187, -0.01921159029006958, 0.02513270452618599, -0.009587287902832031, 0.04426855221390724, 0.0041041746735572815, -0.030852152034640312, 0.02876650169491768, -0.04783773422241211, -0.04467977210879326, 0.008298706263303757, 0.007562875747680664, -0.041229795664548874, -0.0025834068655967712, -0.006311260163784027, -0.045194387435913086, -0.04973635822534561, 0.03167117014527321, -0.015158094465732574, -0.008372105658054352, 0.012012410908937454, -0.017232049256563187, 0.0428430549800396, 0.037876833230257034, -0.0009530298411846161, 0.0010290369391441345, 0.007406853139400482, 0.020317066460847855, 0.004294704645872116, -0.04288562759757042, 0.0008950233459472656, 0.02234623208642006, -0.011137008666992188, -0.04459284618496895, -0.007982432842254639, -0.039381109178066254, -0.029834557324647903, 0.011808682233095169, 0.018340613692998886, -0.04829317331314087, 0.02436206117272377, 0.04033705219626427, 0.04878467693924904, -0.047782182693481445, 0.03436583653092384, -0.021987581625580788, 0.04770468547940254, 0.038461316376924515, -0.02967233769595623, -0.03933751583099365, 0.00325765460729599, -0.0420655831694603, 0.03964461013674736, 0.04007072374224663, 0.02572052553296089, -0.008608244359493256, 0.046381618827581406, 0.027515362948179245, -0.027226591482758522, 0.032007064670324326], [0.03740180656313896, -0.015436828136444092, 0.006145227700471878, 0.01916128769516945, 0.0161406509578228, 0.016628090292215347, 0.00045669078826904297, 0.026298310607671738, 0.010344456881284714, -0.025837374851107597, 0.0064377561211586, 0.00996021181344986, -0.02531871758401394, -0.026976143941283226, -0.002237726002931595, -0.007846295833587646, -0.03347036987543106, 0.03721311315894127, 0.03314242139458656, -0.04622836038470268, 0.014844980090856552, 0.010506771504878998, -0.0316280871629715, -0.03791413456201553, 0.039875078946352005, -0.031557098031044006, -0.02727537229657173, -0.04826166853308678, -0.006413985043764114, -0.018401682376861572, -0.008160222321748734, 0.042618025094270706, -0.006294310092926025, -0.015024863183498383, -0.040666162967681885, 0.03667665645480156, -0.01976105011999607, 0.04888897016644478, 0.03642220422625542, -0.007435988634824753, 0.04449817165732384, 0.021743308752775192, -0.016342271119356155, 0.01781832054257393, 0.016957666724920273, 0.03236868605017662, -0.0334363728761673, -0.035572875291109085, 0.025346282869577408, -0.02845795266330242, 0.049711231142282486, 0.02504107728600502, -0.040668271481990814, 0.005318641662597656, 0.03316832706332207, 0.008526097983121872, 0.03243894502520561, -0.017853043973445892, 0.04645906761288643, -0.025691688060760498, 0.008269239217042923, -0.026596009731292725, 0.0011254176497459412, -0.023043502122163773], [0.028514210134744644, 0.007341157644987106, 0.009562350809574127, 0.006466783583164215, -0.043679844588041306, -0.02388918399810791, 0.021655764430761337, 0.008670270442962646, 0.03716559335589409, -0.014579307287931442, -0.035503923892974854, 0.03304446116089821, 0.03534447029232979, 0.0019970647990703583, -0.022831249982118607, 0.006329406052827835, 0.006999362260103226, -0.04233046993613243, -0.0049780383706092834, 0.04619571194052696, -0.012456215918064117, 0.04292957857251167, 0.016196083277463913, 0.015293586999177933, 0.02754657343029976, -0.0025983676314353943, -0.01243147999048233, -0.02894696034491062, -0.024040687829256058, -0.03646080568432808, -0.03841231018304825, -1.6547739505767822e-05, -0.03023695945739746, -0.003280341625213623, -0.04165320470929146, 0.007525406777858734, -0.016745876520872116, 0.026716653257608414, -0.026041889563202858, -0.03610461950302124, -0.012666117399930954, -0.049490462988615036, 0.00030361488461494446, 0.02070242539048195, -0.010747015476226807, 0.041138116270303726, 0.03968236222863197, -0.03272052854299545, 0.049266163259744644, -0.0392691008746624, 0.03990143910050392, 0.009328197687864304, -0.00832223892211914, 0.012906644493341446, -0.039119016379117966, 0.032621096819639206, -0.017775557935237885, -0.024672377854585648, -0.002779625356197357, 0.024664346128702164, -0.018735837191343307, -6.468221545219421e-05, -0.04280705377459526, -0.009498905390501022], [0.03636154904961586, -0.013670705258846283, 0.015651118010282516, 0.028501618653535843, 0.03858495131134987, 0.030003834515810013, 0.010892711579799652, 0.03768373653292656, 0.043368760496377945, 0.030812490731477737, 0.013315189629793167, -0.025277985259890556, 0.0173967145383358, 0.04209789261221886, 0.03061157837510109, 0.025722991675138474, 0.03862049803137779, -0.004377923905849457, 0.0007143840193748474, -0.012058772146701813, -0.029775286093354225, -0.031212354078888893, 0.03434712067246437, 0.010611675679683685, 0.010891616344451904, 0.020166102796792984, 0.039875853806734085, 0.035612430423498154, 0.03494023159146309, 0.02662685140967369, -0.027028536424040794, -0.039468418806791306, 0.031972531229257584, -0.02387375943362713, 0.04270852729678154, 0.01038585975766182, -0.0011891350150108337, 0.02834336832165718, 0.008707355707883835, -0.0182473286986351, -0.02435838058590889, 0.016412746161222458, 0.01045166328549385, 0.014756571501493454, -0.00020160526037216187, 0.02619112655520439, 0.03630342707037926, -0.032019034028053284, -0.014028571546077728, -0.036806631833314896, -0.011789429932832718, 0.028932739049196243, -0.02754380740225315, 0.028696540743112564, 0.03399613872170448, 0.006361890584230423, 0.007101129740476608, 0.0069984085857868195, -0.016071654856204987, -0.004919588565826416, -0.025170540437102318, -0.04785081371665001, 0.03936794027686119, -0.043371498584747314], [-0.03133608400821686, 0.03130824491381645, -0.024292444810271263, 0.04303939267992973, 0.045447517186403275, -0.04131575673818588, -0.021217763423919678, -0.028990376740694046, 0.044857095927000046, -0.016618646681308746, 0.04320089891552925, 0.04072454199194908, -0.03437694162130356, 0.046428922563791275, -0.00392451137304306, -0.020067298784852028, -0.04970172792673111, 0.01300584152340889, 0.006355665624141693, 0.037936512380838394, 0.04163629934191704, -0.001917041838169098, -0.015129707753658295, -0.0013966672122478485, 0.0025439634919166565, 0.04309452697634697, -0.03293149545788765, -0.028362011536955833, 0.0288904570043087, -0.03947632387280464, 0.020673107355833054, 0.024353232234716415, 0.046903494745492935, -0.04037414863705635, -0.02944467030465603, 0.0003764517605304718, -0.04046926647424698, 0.0271797813475132, 0.0072779059410095215, -0.0242751594632864, 0.026661071926355362, 0.02110150083899498, -0.027383148670196533, -0.04733561351895332, -0.003152705729007721, 0.04855438694357872, 0.04095872864127159, 0.017919983714818954, 0.04181307926774025, 0.010636568069458008, -0.03986942768096924, -0.017890572547912598, -0.00581514835357666, -0.04184988886117935, -0.0464635007083416, -0.04632509872317314, 0.02757999673485756, -0.019304489716887474, 0.04178479686379433, -0.016536809504032135, -0.02206789329648018, 0.006226945668458939, 0.03347517177462578, 0.026635456830263138], [0.04432683065533638, 0.049282755702733994, -0.014452744275331497, 0.025671493262052536, -0.0062607526779174805, 0.029054228216409683, 0.027176883071660995, 0.027225647121667862, 0.01659432426095009, -0.04707835987210274, -0.010229777544736862, -0.001872241497039795, 0.001263987272977829, 0.013194266706705093, -0.02952362410724163, 0.04876014217734337, 0.0013751015067100525, -0.03902745246887207, 0.014722537249326706, -0.025486910715699196, 0.044827546924352646, 0.03712501749396324, 0.020701829344034195, -0.04372335597872734, -0.028460562229156494, 0.015243243426084518, 0.034232381731271744, 0.014236103743314743, 0.000650264322757721, 0.028243448585271835, -0.03225158527493477, 0.03134751692414284, -0.005481421947479248, -0.041355740278959274, 0.039489101618528366, -0.03902240842580795, 0.026650894433259964, -0.039591290056705475, 0.025469068437814713, -0.033714570105075836, -0.009625889360904694, -0.04731062799692154, -0.025750065222382545, 0.005361031740903854, 0.021083150058984756, -0.022098302841186523, 0.04490545019507408, -0.014050424098968506, 0.017905723303556442, -0.02578793838620186, 0.018311168998479843, 0.004970084875822067, -0.03815183788537979, 0.015044067054986954, -0.04026234149932861, 0.008200716227293015, 0.008533239364624023, 0.03176439180970192, -0.00045361369848251343, -0.03492765501141548, -0.03554420545697212, -0.016166996210813522, 0.003329586237668991, -0.03018174134194851], [-0.0348011739552021, 0.035989273339509964, 0.03774673119187355, -0.0073392391204833984, 0.004036031663417816, -0.019551564007997513, -0.02091733179986477, -0.0037387721240520477, 0.04457707330584526, -0.010132323950529099, -0.042349983006715775, -0.0416867621243, -0.032163217663764954, 0.009013760834932327, -0.030636882409453392, -0.030503202229738235, -0.02525505982339382, -0.04047400876879692, -0.027555836364626884, 0.048335183411836624, -0.04210102558135986, -0.015684854239225388, 0.026428867131471634, -0.027063537389039993, 0.02676863595843315, -0.0067093148827552795, 0.03355671092867851, -0.017503689974546432, -0.041377902030944824, -0.005628954619169235, 0.046751249581575394, -0.016585908830165863, 0.04330338165163994, 0.030615780502557755, 0.03198423609137535, -0.006390489637851715, 0.0021575093269348145, -0.008178245276212692, 0.04845144972205162, -0.02651308849453926, -0.035505782812833786, -0.005747832357883453, -0.040724873542785645, 0.04089650139212608, -0.0477970726788044, -0.028360843658447266, -0.03392978012561798, 0.01892625167965889, -0.04682166501879692, 0.028093982487916946, -0.01811741665005684, -0.00036231428384780884, -0.03246702998876572, -0.02918337658047676, -0.03795753791928291, -0.03170744329690933, 0.04001936689019203, 0.046485912054777145, -0.005116354674100876, 0.04420984163880348, 0.03688747063279152, 0.008686911314725876, -0.025467026978731155, 0.02077610418200493], [0.01921844854950905, -0.04993557929992676, -0.014779973775148392, -0.011572431772947311, 0.04515821859240532, -0.0012988224625587463, -0.04570888355374336, 0.04180185869336128, 0.031530093401670456, -0.013060271739959717, -0.04898957163095474, -0.04365856572985649, 0.03058287873864174, 0.03590751066803932, 0.011453591287136078, -0.038286495953798294, 0.006564140319824219, 0.017209503799676895, 0.023960541933774948, -0.02465510368347168, 0.04136011376976967, 0.01823526993393898, 0.002473793923854828, 0.00833282619714737, 0.0008531808853149414, 0.013659145683050156, -0.046041298657655716, -0.02737027406692505, -0.03247424215078354, 0.012148521840572357, 0.04748106375336647, 0.04537219926714897, 0.03376537933945656, 0.02597292885184288, 0.03170839324593544, 0.0416802279651165, -0.04269719123840332, -0.0022420063614845276, -0.030974090099334717, 0.0012831911444664001, 0.00115884467959404, 0.007867731153964996, 0.010565899312496185, -0.01170869916677475, 0.02448606863617897, -0.009767591953277588, 0.0458885096013546, -0.0032815933227539062, -0.022079169750213623, -0.010596178472042084, -0.019650494679808617, -0.0352480411529541, 0.046076323837041855, 0.01222626119852066, -0.0001628287136554718, 0.011760473251342773, -0.0001883283257484436, 0.02563253417611122, -0.011950802057981491, 0.026073578745126724, -0.013386130332946777, -0.01702430099248886, -0.04798494651913643, 0.016494404524564743], [-0.03133450821042061, 0.01353379711508751, 0.025494541972875595, -0.002653788775205612, -0.00047016143798828125, -0.027699291706085205, -0.01969132386147976, 0.023886624723672867, -0.045310236513614655, -0.015766728669404984, 0.005344212055206299, 0.02751540020108223, 0.021778885275125504, 0.009569130837917328, -0.017103910446166992, 0.008722197264432907, 0.031206298619508743, -0.010167550295591354, -0.01647782325744629, 0.006284892559051514, 0.0394192598760128, 0.0390571691095829, -0.028350830078125, -0.03825026750564575, -0.01258152723312378, 0.01644292101264, -0.04030816629528999, 0.0017947442829608917, 0.004467178136110306, -0.045193590223789215, -0.03068079985678196, 0.010482918471097946, -0.03521435335278511, 0.042961131781339645, 0.023952212184667587, 0.009616076946258545, -0.04084807634353638, 0.016051840037107468, 0.049022410064935684, 0.03437386825680733, -0.03455008193850517, -0.020671356469392776, 0.016783129423856735, 0.02217772975564003, -0.0030144229531288147, 0.0045581236481666565, 0.04037442430853844, -0.04084266349673271, -0.023574531078338623, -0.02867339923977852, 0.023435387760400772, 0.014284919947385788, 0.017557058483362198, 0.013003472238779068, -0.04923785850405693, -0.024760652333498, -0.0020802728831768036, -0.027668846771121025, -0.01348661258816719, -0.009749364107847214, -0.01273561641573906, -0.021883249282836914, 0.023116160184144974, -0.010893084108829498], [-0.013397742062807083, 0.04282252863049507, 0.02903876081109047, -0.0018219128251075745, -0.03237410634756088, -0.03695201873779297, 0.040111374109983444, -0.026689661666750908, 0.030902300029993057, 0.04524029418826103, 0.024923693388700485, 0.038548026233911514, -0.0350065603852272, 0.045346949249506, 0.01977137103676796, 0.039326656609773636, 0.00497746467590332, 0.019976738840341568, 0.028510164469480515, -0.03675021976232529, -0.029529346153140068, 0.04647446796298027, 0.007686186581850052, 0.042519185692071915, 0.00817718356847763, -0.0188842061907053, 0.014080945402383804, -0.02309328317642212, -0.04396367073059082, 0.04330224171280861, 0.03254317119717598, -0.0386730432510376, -0.018592797219753265, -0.012797892093658447, 0.01937626674771309, -0.038046348839998245, 0.030229005962610245, 0.026721183210611343, -0.021160578355193138, -0.01928952895104885, -0.04268110916018486, -0.02088344097137451, -0.008873380720615387, -0.03239523246884346, 0.014659035950899124, -0.03689302131533623, 0.002616189420223236, 0.018287334591150284, 0.026959899812936783, -0.049140822142362595, -0.022859573364257812, 0.02195967361330986, 0.011296510696411133, 0.04628460481762886, 0.011883020401000977, -0.022662699222564697, 0.028125081211328506, 0.005702804774045944, -0.043831419199705124, -0.020345617085695267, 0.007225144654512405, 0.016569409519433975, 0.045478787273168564, 0.0392257459461689], [-0.01539008691906929, -0.04576941952109337, 0.02845935896039009, 0.013223860412836075, -0.030856920406222343, 0.01343676820397377, -0.045070815831422806, -0.03056924417614937, 0.047315727919340134, -0.030652809888124466, -0.04197496175765991, -0.006323922425508499, 0.016782987862825394, 0.018628429621458054, 0.04314320161938667, -0.0282629132270813, -0.0488739013671875, -0.012383721768856049, -0.007671963423490524, 0.030604783445596695, 0.04135216400027275, -0.029769396409392357, -0.048625778406858444, 0.018610667437314987, -0.018508683890104294, 0.00915304571390152, -0.010205112397670746, 0.02138083055615425, 0.03143073245882988, -0.015383519232273102, -0.027423931285738945, -0.0074117667973041534, 0.03317466750741005, -0.004309751093387604, 0.035888854414224625, -0.02741985395550728, -0.026649152860045433, 0.030318651348352432, 0.015653740614652634, 0.003284372389316559, -0.03757363557815552, -0.005106519907712936, -0.01815478876233101, 0.030014801770448685, -0.0138077512383461, 0.04312226548790932, -0.01680229976773262, 0.032435957342386246, -0.003472317010164261, 0.041622910648584366, 0.007626570761203766, -0.035359226167201996, -6.774812936782837e-05, 0.04779389873147011, -0.042995940893888474, -0.014161430299282074, -0.015980303287506104, -0.010557211935520172, 0.00820249319076538, 0.039598140865564346, -0.002098929136991501, 0.003911960870027542, -0.018169082701206207, -0.006666839122772217], [0.006162870675325394, -0.02667219750583172, -0.003725804388523102, -0.03630669042468071, -0.014414943754673004, -0.01661060005426407, 0.04185060039162636, 0.015407074242830276, 0.026832591742277145, 0.02553173527121544, 0.02806750312447548, 0.024288486689329147, 0.013369526714086533, -0.0340174064040184, -0.012305177748203278, 0.01068960502743721, -0.03638748079538345, 0.0313866026699543, 0.014772716909646988, 0.02509002760052681, -0.022249890491366386, 0.008131910115480423, -0.03304177522659302, -0.026608455926179886, 0.0422053225338459, -0.029445815831422806, -0.04154670238494873, 0.03608277812600136, -0.04620467498898506, -0.03663508966565132, 0.03548945114016533, 0.04803274944424629, -0.025081897154450417, 0.029570911079645157, 0.005308281630277634, -0.0044473521411418915, -0.04750323295593262, -0.0017166249454021454, -0.011998128145933151, 0.03711371496319771, 0.023727823048830032, -0.0032817013561725616, -0.017628587782382965, 